In [1]:
import pandas as pd

In [8]:
# data = [
#     {'name': 'Kashyap', 'age':26, 'location':'Nagpur'},
#     {'name': 'Raju', 'age':28, 'location':'Pune'},
#     {'name': 'Khaju', 'age':31, 'location':'Mumbai'},
#     {'name': 'Bhaju', 'age':21, 'location':'Delhi'}
# ]

data = {
    'name':['Kashyap','raju','khaju','bhaju'],
    'age':[26,43,23,64],
    'place': ['nagpur','pune','mumbai','delhi']
}

In [9]:
df = pd.DataFrame(data)

In [10]:
df

      name  age   place
0  Kashyap   26  nagpur
1     raju   43    pune
2    khaju   23  mumbai
3    bhaju   64   delhi

In [13]:
df.to_csv("data/data.csv", index=False)